chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
    script_state = SCRIPT_RUNNING;
    script_wait_start_ms = 0U;
    APP_LOG("SCRIPT: obstacle_clear resume step=%u/%u action=%s",
            (unsigned int)(script_step_index + 1U),
            (unsigned int)((script_current != NULL) ? script_current->count : 0U),
            AppBenchmarkScript_ActionName(step->action));
    AppBenchmarkScript_StartStep(now_ms);
}

static void AppBenchmarkScript_Abort(BenchmarkScriptState_t state, const char *reason)
{
    Chassis_Stop();
    script_state = state;
    AppBenchmarkScript_ClearRuntime();
    APP_LOG("SCRIPT: abort state=%s reason=%s",
            AppBenchmarkScript_StateName(state),
            (reason != NULL) ? reason : "unspecified");
}

static void AppBenchmarkScript_CheckForwardSafety(uint32_t now_ms)
{
    if (AppBenchmarkScript_LidarFrontStale(now_ms))
    {
        Chassis_Stop();
        script_state = SCRIPT_WAIT_OBSTACLE_CLEAR;
        script_wait_start_ms = now_ms;
        script_step_active = 0U;
        script_step_just_started = 0U;
        APP_LOG("SCRIPT: wait reason=lidar_invalid_or_stale");
        return;
    }

    if (AppBenchmarkScript_LidarFrontBlocked(now_ms))
    {
        const AppLidarStatus *lidar = App_Lidar_GetStatus();
        Chassis_Stop();
        script_state = SCRIPT_WAIT_OBSTACLE_CLEAR;
        script_wait_start_ms = now_ms;
        script_step_active = 0U;
        script_step_just_started = 0U;
        APP_LOG("SCRIPT: wait reason=front_blocked front=%u stop=%u",
                (unsigned int)((lidar != NULL) ? lidar->front_min_mm : 0U),
                (unsigned int)SCRIPT_OBSTACLE_STOP_MM);
    }
}

static void AppBenchmarkScript_UpdateWaitObstacleClear(uint32_t now_ms)
{
    if (AppBenchmarkScript_LidarFrontClear(now_ms))
    {
        AppBenchmarkScript_ResumeCurrentStep(now_ms);
        return;
    }

    AppBenchmarkScript_LogLowRate(now_ms, "SCRIPT: waiting obstacle clear");
}

static void AppBenchmarkScript_UpdateAuto(uint32_t now_ms)
{
    switch (script_state)
    {
        case SCRIPT_AUTO_FORWARD:
            AppBenchmarkScript_UpdateAutoForward(now_ms);
            break;

        case SCRIPT_AUTO_TURN_RIGHT:
            AppBenchmarkScript_UpdateAutoTurnRight(now_ms);
            break;

        case SCRIPT_AUTO_WAIT_CLEAR:
            AppBenchmarkScript_UpdateAutoWaitClear(now_ms);
            break;

        default:
            break;
    }
}

static void AppBenchmarkScript_UpdateAutoForward(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if (script_state != SCRIPT_AUTO_FORWARD)
    {
        return;
    }

    if (AppBenchmarkScript_LidarFrontStale(now_ms))
    {
        AppBenchmarkScript_EnterAutoWaitClear(now_ms, "lidar_invalid_or_stale");
        return;
    }

    if (AppBenchmarkScript_AutoFrontBlocked(now_ms))
    {
        uint32_t front_mm = (lidar != NULL) ? lidar->front_min_mm : 0U;
        Chassis_Stop();
        AppBenchmarkScript_EnterAutoTurnRight(now_ms, front_mm);
        return;
    }

    AppBenchmarkScript_ApplyForwardTrim();
    AppBenchmarkScript_LogLowRate(now_ms, "SCRIPT: auto forward");
}

static void AppBenchmarkScript_UpdateAutoTurnRight(uint32_t now_ms)
{
    if (script_state != SCRIPT_AUTO_TURN_RIGHT)
    {
        return;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms) >= AUTO_TURN_RIGHT_MS)
    {
        APP_LOG("SCRIPT: auto turn_right done elapsed=%lums",
                (unsigned long)AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms));
        AppBenchmarkScript_EnterAutoForward(now_ms, "turn_done");
        return;
    }

    Chassis_TurnRight(AUTO_TURN_DUTY);
}

static void AppBenchmarkScript_UpdateAutoWaitClear(uint32_t now_ms)
{
    if (script_state != SCRIPT_AUTO_WAIT_CLEAR)
    {
        return;
    }

    Chassis_Stop();
    if (AppBenchmarkScript_AutoFrontClear(now_ms))
    {
        AppBenchmarkScript_EnterAutoForward(now_ms, "front_clear");
        return;
    }

    AppBenchmarkScript_LogLowRate(now_ms, "SCRIPT: auto waiting clear");
}

static void AppBenchmarkScript_UpdateReturnAuto(uint32_t now_ms)
{
    switch (script_state)
    {
        case SCRIPT_RETURN_AUTO_TURN_AROUND:
            AppBenchmarkScript_UpdateReturnAutoTurnAround(now_ms);
            break;

        case SCRIPT_RETURN_AUTO_FORWARD:
            AppBenchmarkScript_UpdateReturnAutoForward(now_ms);
            break;

        case SCRIPT_RETURN_AUTO_TURN_LEFT:
            AppBenchmarkScript_UpdateReturnAutoTurnLeft(now_ms);
            break;

        case SCRIPT_RETURN_AUTO_WAIT_CLEAR:
            AppBenchmarkScript_UpdateReturnAutoWaitClear(now_ms);
            break;

        default:
            break;
    }
}

static void AppBenchmarkScript_UpdateReturnAutoTurnAround(uint32_t now_ms)
{
    if (script_state != SCRIPT_RETURN_AUTO_TURN_AROUND)
    {
        return;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms) >= RETURN_AUTO_TURN_AROUND_MS)
    {
        AppBenchmarkScript_EnterReturnAutoForward(now_ms, "turnaround_done");
        return;
    }

    Chassis_TurnRight(AUTO_TURN_DUTY);
}

static void AppBenchmarkScript_UpdateReturnAutoForward(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if (script_state != SCRIPT_RETURN_AUTO_FORWARD)
    {
        return;
    }

    if (AppBenchmarkScript_LidarFrontStale(now_ms))
    {
        AppBenchmarkScript_EnterReturnAutoWaitClear(now_ms, "lidar_invalid_or_stale");
        return;
    }

    if (AppBenchmarkScript_AutoFrontBlocked(now_ms))
    {
        uint32_t front_mm = (lidar != NULL) ? lidar->front_min_mm : 0U;
        Chassis_Stop();
        AppBenchmarkScript_EnterReturnAutoTurnLeft(now_ms, front_mm);
        return;
    }

    AppBenchmarkScript_ApplyForwardTrim();
    AppBenchmarkScript_LogLowRate(now_ms, "SCRIPT: return_auto forward");
}

static void AppBenchmarkScript_UpdateReturnAutoTurnLeft(uint32_t now_ms)
{
    if (script_state != SCRIPT_RETURN_AUTO_TURN_LEFT)
    {
        return;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms) >= RETURN_AUTO_TURN_LEFT_MS)
    {
        APP_LOG("SCRIPT: return_auto turn_left done elapsed=%lums",
                (unsigned long)AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms));
        AppBenchmarkScript_EnterReturnAutoForward(now_ms, "turn_done");
        return;
    }

    Chassis_TurnLeft(AUTO_TURN_DUTY);
}

static void AppBenchmarkScript_UpdateReturnAutoWaitClear(uint32_t now_ms)
{
    if (script_state != SCRIPT_RETURN_AUTO_WAIT_CLEAR)
    {
        return;
    }

    Chassis_Stop();
    if (AppBenchmarkScript_AutoFrontClear(now_ms))
    {
        AppBenchmarkScript_EnterReturnAutoForward(now_ms, "front_clear");
        return;
    }

    AppBenchmarkScript_LogLowRate(now_ms, "SCRIPT: return_auto waiting clear");
}

static void AppBenchmarkScript_EnterAutoForward(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_AUTO_FORWARD;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_FORWARD;
    script_current_action_valid = 1U;
    AppBenchmarkScript_ApplyForwardTrim();
    APP_LOG("SCRIPT: auto state=FORWARD dutyL=%d dutyR=%d reason=%s",
            (int)BENCH_FORWARD_LEFT_DUTY,
            (int)BENCH_FORWARD_RIGHT_DUTY,
            (reason != NULL) ? reason : "none");
    AppBenchmarkScript_UpdateAutoForward(now_ms);
}

