chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
static void AppBenchmarkScript_EnterAutoTurnRight(uint32_t now_ms, uint32_t front_mm)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_AUTO_TURN_RIGHT;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_TURN_RIGHT;
    script_current_action_valid = 1U;
    Chassis_TurnRight(AUTO_TURN_DUTY);
    APP_LOG("SCRIPT: auto state=TURN_RIGHT duty=%d dur=%ums front=%u stop=%u",
            (int)AUTO_TURN_DUTY,
            (unsigned int)AUTO_TURN_RIGHT_MS,
            (unsigned int)front_mm,
            (unsigned int)AUTO_OBSTACLE_STOP_MM);
}

static void AppBenchmarkScript_EnterAutoWaitClear(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_AUTO_WAIT_CLEAR;
    script_step_start_ms = now_ms;
    script_wait_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_current_action = SCRIPT_ACT_WAIT;
    script_current_action_valid = 1U;
    Chassis_Stop();
    APP_LOG("SCRIPT: auto state=WAIT_CLEAR reason=%s clear=%u",
            (reason != NULL) ? reason : "none",
            (unsigned int)AUTO_OBSTACLE_CLEAR_MM);
}

static void AppBenchmarkScript_EnterReturnAutoTurnAround(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_TURN_AROUND;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_TURN_RIGHT;
    script_current_action_valid = 1U;
    Chassis_TurnRight(AUTO_TURN_DUTY);
    APP_LOG("SCRIPT: return_auto state=TURN_AROUND duty=%d dur=%ums reason=%s",
            (int)AUTO_TURN_DUTY,
            (unsigned int)RETURN_AUTO_TURN_AROUND_MS,
            (reason != NULL) ? reason : "none");
}

static void AppBenchmarkScript_EnterReturnAutoForward(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_FORWARD;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_FORWARD;
    script_current_action_valid = 1U;
    AppBenchmarkScript_ApplyForwardTrim();
    APP_LOG("SCRIPT: return_auto state=FORWARD dutyL=%d dutyR=%d reason=%s",
            (int)BENCH_FORWARD_LEFT_DUTY,
            (int)BENCH_FORWARD_RIGHT_DUTY,
            (reason != NULL) ? reason : "none");
    AppBenchmarkScript_UpdateReturnAutoForward(now_ms);
}

static void AppBenchmarkScript_EnterReturnAutoTurnLeft(uint32_t now_ms, uint32_t front_mm)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_TURN_LEFT;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_TURN_LEFT;
    script_current_action_valid = 1U;
    Chassis_TurnLeft(AUTO_TURN_DUTY);
    APP_LOG("SCRIPT: return_auto state=TURN_LEFT duty=%d dur=%ums front=%u stop=%u",
            (int)AUTO_TURN_DUTY,
            (unsigned int)RETURN_AUTO_TURN_LEFT_MS,
            (unsigned int)front_mm,
            (unsigned int)AUTO_OBSTACLE_STOP_MM);
}

static void AppBenchmarkScript_EnterReturnAutoWaitClear(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_WAIT_CLEAR;
    script_step_start_ms = now_ms;
    script_wait_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_current_action = SCRIPT_ACT_WAIT;
    script_current_action_valid = 1U;
    Chassis_Stop();
    APP_LOG("SCRIPT: return_auto state=WAIT_CLEAR reason=%s clear=%u",
            (reason != NULL) ? reason : "none",
            (unsigned int)AUTO_OBSTACLE_CLEAR_MM);
}

static const BenchmarkScriptStep_t *AppBenchmarkScript_CurrentStep(void)
{
    if ((script_current == NULL) || (script_step_index >= script_current->count))
    {
        return NULL;
    }

    return &script_current->steps[script_step_index];
}

static uint32_t AppBenchmarkScript_ElapsedMs(uint32_t now_ms, uint32_t then_ms)
{
    if (now_ms >= then_ms)
    {
        return now_ms - then_ms;
    }

    return 0U;
}

static bool AppBenchmarkScript_LidarFrontClear(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm > SCRIPT_OBSTACLE_CLEAR_MM);
}

static bool AppBenchmarkScript_LidarFrontBlocked(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm < SCRIPT_OBSTACLE_STOP_MM);
}

static bool AppBenchmarkScript_LidarFrontStale(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return true;
    }

    return (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS);
}

static bool AppBenchmarkScript_AutoFrontClear(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm > AUTO_OBSTACLE_CLEAR_MM);
}

static bool AppBenchmarkScript_AutoFrontBlocked(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

