chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm < AUTO_OBSTACLE_STOP_MM);
}

static bool AppBenchmarkScript_IsAutoState(BenchmarkScriptState_t state)
{
    return ((state == SCRIPT_AUTO_FORWARD) ||
            (state == SCRIPT_AUTO_TURN_RIGHT) ||
            (state == SCRIPT_AUTO_WAIT_CLEAR));
}

static bool AppBenchmarkScript_IsReturnAutoState(BenchmarkScriptState_t state)
{
    return ((state == SCRIPT_RETURN_AUTO_TURN_AROUND) ||
            (state == SCRIPT_RETURN_AUTO_FORWARD) ||
            (state == SCRIPT_RETURN_AUTO_TURN_LEFT) ||
            (state == SCRIPT_RETURN_AUTO_WAIT_CLEAR));
}

static bool AppBenchmarkScript_IsActiveState(BenchmarkScriptState_t state)
{
    return ((state == SCRIPT_RUNNING) ||
            (state == SCRIPT_WAIT_OBSTACLE_CLEAR) ||
            AppBenchmarkScript_IsAutoState(state) ||
            AppBenchmarkScript_IsReturnAutoState(state));
}

static const char *AppBenchmarkScript_CurrentName(void)
{
    if (script_current != NULL)
    {
        return script_current->name;
    }

    if (AppBenchmarkScript_IsAutoState(script_state))
    {
        return "script_auto";
    }

    if (AppBenchmarkScript_IsReturnAutoState(script_state))
    {
        return "script_return_auto";
    }

    return "none";
}

static void AppBenchmarkScript_LogLowRate(uint32_t now_ms, const char *message)
{
    if ((script_last_log_ms == 0U) ||
        (AppBenchmarkScript_ElapsedMs(now_ms, script_last_log_ms) >= SCRIPT_LOG_INTERVAL_MS))
    {
        script_last_log_ms = now_ms;
        APP_LOG("%s", (message != NULL) ? message : "SCRIPT: wait");
    }
}
